# Key -> Data -> Split -> Apply -> Combine

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as pl
import seaborn as sns
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randint(1,5,5),
'data2' : np.random.randint(1,5,5)})

In [2]:
df

  key1 key2  data1  data2
0    a  one      1      1
1    a  two      1      1
2    b  one      4      4
3    b  two      1      2
4    a  one      1      3

In [3]:
pd.crosstab(df['key1'],df['key2'])

key2  one  two
key1
a       2    1
b       1    1

In [4]:
grouped=df['data1'].groupby(df['key1'])
grouped

In [5]:
grouped.mean()

key1
a    1.0
b    2.5
Name: data1, dtype: float64

In [6]:
means=df['data1'].groupby([df['key1'],df['key2']]).sum()
means

key1  key2
a     one     2
      two     1
b     one     4
      two     1
Name: data1, dtype: int32

In [7]:
means.unstack()

key2  one  two
key1
a       2    1
b       4    1

In [8]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
grouped=df['data1'].groupby([states,years])
grouped.mean()

California  2005    1
            2006    4
Ohio        2005    1
            2006    1
Name: data1, dtype: int32

In [9]:
df.groupby(['key1','key2']).mean()

           data1  data2
key1 key2
a    one       1      2
     two       1      1
b    one       4      4
     two       1      2

In [10]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [11]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)
    print("\n")

a
  key1 key2  data1  data2
0    a  one      1      1
1    a  two      1      1
4    a  one      1      3


b
  key1 key2  data1  data2
2    b  one      4      4
3    b  two      1      2

In [12]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2  data1  data2
0    a  one      1      1
4    a  one      1      3
('a', 'two')
  key1 key2  data1  data2
1    a  two      1      1
('b', 'one')
  key1 key2  data1  data2
2    b  one      4      4
('b', 'two')
  key1 key2  data1  data2
3    b  two      1      2

In [13]:
pieces=dict(list(df.groupby('key1')))
pieces

{'a':   key1 key2  data1  data2
 0    a  one      1      1
 1    a  two      1      1
 4    a  one      1      3,
 'b':   key1 key2  data1  data2
 2    b  one      4      4
 3    b  two      1      2}

In [14]:
list(df.groupby('key1'))

[('a',
    key1 key2  data1  data2
  0    a  one      1      1
  1    a  two      1      1
  4    a  one      1      3),
 ('b',
    key1 key2  data1  data2
  2    b  one      4      4
  3    b  two      1      2)]

In [15]:
pieces['b']

  key1 key2  data1  data2
2    b  one      4      4
3    b  two      1      2

In [16]:
pieces['a']

  key1 key2  data1  data2
0    a  one      1      1
1    a  two      1      1
4    a  one      1      3

In [17]:
df.dtypes

key1     object
key2     object
data1     int32
data2     int32
dtype: object

In [18]:
grouped=df.groupby(df.dtypes,axis=1)
list(grouped)

[(dtype('int32'),
     data1  data2
  0      1      1
  1      1      1
  2      4      4
  3      1      2
  4      1      3),
 (dtype('O'),
    key1 key2
  0    a  one
  1    a  two
  2    b  one
  3    b  two
  4    a  one)]

In [19]:
for dtype,group in grouped:
    print(dtype)
    print(group)

int32
   data1  data2
0      1      1
1      1      1
2      4      4
3      1      2
4      1      3
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [20]:
people = pd.DataFrame(np.random.randn(5, 5),
        columns=['a', 'b', 'c', 'd', 'e'],
        index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe     0.988478  0.171572  0.258496  0.448098  1.492505
Steve   1.824385 -0.498233  0.126030 -0.696323 -0.628399
Wes    -0.145812  0.194665  0.493741 -1.339296  1.247208
Jim    -0.861763 -1.530564 -0.203713 -0.607217 -0.626722
Travis  1.359108  0.528250  0.004141  1.533949  0.981036

In [21]:
people.iloc[2:3,[1,2]]=np.nan

In [22]:
people

               a         b         c         d         e
Joe     0.988478  0.171572  0.258496  0.448098  1.492505
Steve   1.824385 -0.498233  0.126030 -0.696323 -0.628399
Wes    -0.145812       NaN       NaN -1.339296  1.247208
Jim    -0.861763 -1.530564 -0.203713 -0.607217 -0.626722
Travis  1.359108  0.528250  0.004141  1.533949  0.981036

In [23]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
        'd': 'blue', 'e': 'red', 'e' : 'orange'}

In [24]:
by_column=people.groupby(mapping,axis=1)

In [25]:
by_column.sum()

            blue    orange       red
Joe     0.706594  1.492505  1.160050
Steve  -0.570293 -0.628399  1.326151
Wes    -1.339296  1.247208 -0.145812
Jim    -0.810930 -0.626722 -2.392327
Travis  1.538090  0.981036  1.887358

In [26]:
map_series=pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e    orange
dtype: object

In [27]:
people.groupby(map_series,axis=1).count(),

(        blue  orange  red
 Joe        2       1    2
 Steve      2       1    2
 Wes        1       1    1
 Jim        2       1    2
 Travis     2       1    2,)

In [28]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.019097 -1.358993  0.054782 -1.498414  2.112991
5  1.824385 -0.498233  0.126030 -0.696323 -0.628399
6  1.359108  0.528250  0.004141  1.533949  0.981036

In [29]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.145812  0.171572  0.258496 -1.339296  1.247208
  two -0.861763 -1.530564 -0.203713 -0.607217 -0.626722
5 one  1.824385 -0.498233  0.126030 -0.696323 -0.628399
6 two  1.359108  0.528250  0.004141  1.533949  0.981036

In [30]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
    [1, 3, 5, 1, 3]],
    names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [31]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.554279 -0.904853  1.297878 -0.081095 -0.392462
1      1.018348 -1.687808 -0.263415  0.677675 -0.875439
2      1.063538 -1.817150 -0.836519  0.111031 -0.670921
3     -0.027447  1.849173  0.147388 -0.538163 -0.146400

In [32]:
hier_df.groupby('cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [33]:
grouped=df.groupby('key1')
list(grouped)

[('a',
    key1 key2  data1  data2
  0    a  one      1      1
  1    a  two      1      1
  4    a  one      1      3),
 ('b',
    key1 key2  data1  data2
  2    b  one      4      4
  3    b  two      1      2)]

In [34]:
pd.Series(grouped)

0    (a, [key1, key2, data1])
1           (b, [key1, key2])
dtype: object

In [35]:
grouped['data1'].quantile(0.9)

key1
a    1.0
b    3.7
Name: data1, dtype: float64

In [36]:
a=pd.Series(np.arange(0,12))
a

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
dtype: int32

In [37]:
a.quantile(0.5)

5.5

In [38]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [39]:
peak_to_peak(grouped_pct)

NameError: name 'grouped_pct' is not defined

In [ ]:
grouped.agg(peak_to_peak)

In [ ]:
grouped.describe()

In [ ]:
tips=sns.load_dataset('tips')
tips.head()

In [ ]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [ ]:
tips.head()

In [ ]:
grouped=tips.groupby(['day','smoker'])
grouped_pct=grouped['tip_pct']

In [ ]:
grouped_pct.mean()

In [ ]:
# or above and below are same :)
grouped_pct.agg('mean')

In [ ]:
grouped_pct.agg(['mean','std',peak_to_peak])

In [ ]:
grouped_pct.agg([('foo','mean'),('bar',np.std)]).reset_index()

In [ ]:
functions=['count','mean','std','min','max']
grouped['tip_pct','total_bill'].agg(functions)

In [ ]:
grouped.agg({'tip':np.max,'size':'sum'})

In [ ]:
a=tips.groupby(['day','smoker'],as_index=False).mean()
a

In [ ]:
a.keys()

In [ ]:
a.index

In [ ]:
b=tips.groupby(['day','smoker']).mean().reset_index()
b

In [ ]:
b.keys()

In [ ]:
a.keys()==b.keys()

In [ ]:
a==b

In [ ]:
def top(df,n=5,column='tip_pct'):
    return df.sort_values(by=column)[:-n]
top(tips,n=6)

In [ ]:
tips.groupby('smoker').apply(top)

In [ ]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

In [ ]:
result=tips.groupby('smoker')['tip_pct'].describe()
result

In [ ]:
result.unstack('smoker')

In [ ]:
f=lambda x: x.describe()
grouped.apply(f)

In [ ]:
tips.groupby('smoker',group_keys=False).apply(top)

In [ ]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
        'data2': np.random.randn(1000)})
frame

In [ ]:
quartiles=pd.cut(frame.data1,4)
quartiles[:10]

In [ ]:
a=np.arange(2,10)
b=[1,3,5,10]
pd.cut(a,b),a

In [ ]:
def get_stats(group):
    return{'min':group.min(),'max':group.max(),
           'count':group.count(),'mean':group.mean()}

In [ ]:
grouped=frame.data2.groupby(quartiles)

In [ ]:
grouped.apply(get_stats).unstack(1)

filling null

In [40]:
s=pd.Series(np.random.randn(6))

In [42]:
s[::2]=np.nan

In [46]:
s.fillna(s.mean(),inplace=True)

In [47]:
s

0    0.306284
1    0.004554
2    0.306284
3    1.141072
4    0.306284
5   -0.226773
dtype: float64

In [48]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
    'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)

In [49]:
data

Ohio         -0.261291
New York     -0.466502
Vermont       2.048449
Florida      -0.913245
Oregon        1.335667
Nevada       -0.445080
California   -1.006650
Idaho         0.184268
dtype: float64

In [64]:
data.iloc[[2,5,7]]=np.nan
# or data[[2,5,7]]=np.nan both are same

In [65]:
data

Ohio         -0.261291
New York     -0.466502
Vermont            NaN
Florida      -0.913245
Oregon        1.335667
Nevada             NaN
California   -1.006650
Idaho              NaN
dtype: float64

In [71]:
data.groupby(group_key).mean()

East   -0.547013
West    0.164508
dtype: float64

In [68]:
list(data.groupby(group_key))

[('East',
  Ohio       -0.261291
  New York   -0.466502
  Vermont          NaN
  Florida    -0.913245
  dtype: float64),
 ('West',
  Oregon        1.335667
  Nevada             NaN
  California   -1.006650
  Idaho              NaN
  dtype: float64)]

In [84]:
fill_values={'East':0.5,'West':-1}
fill_func=lambda g:g.fillna(fill_values[g.name])
# i dont know the meaning of g.name

In [76]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.261291
New York     -0.466502
Vermont       0.500000
Florida      -0.913245
Oregon        1.335667
Nevada       -1.000000
California   -1.006650
Idaho        -1.000000
dtype: float64

In [121]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []

In [122]:
base_names

['A', 2, 3, 4, 5, 6, 7, 8, 9, 10, 'J', 'K', 'Q']

In [123]:
for suit in suits:
    cards.extend(str(name)+str(suit) for name in base_names)
deck=pd.Series(card_val,index=cards)

In [124]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [141]:
def draw(deck,n=5):
    return deck.sample(n)
draw(deck)

5D      5
10C    10
5H      5
KD     10
6H      6
dtype: int64

In [151]:
a=pd.Series(np.arange(10))
a.sample(4)

8    8
2    2
6    6
0    0
dtype: int32

In [162]:
get_suit=lambda card:card[-1]
a=deck.groupby(get_suit)

In [229]:
a.apply(draw,n=2)

C  4C     4
   8C     8
D  QD    10
   3D     3
H  QH    10
   2H     2
S  QS    10
   JS    10
dtype: int64

In [248]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

AC     1
4C     4
4D     4
AD     1
JH    10
QH    10
7S     7
QS    10
dtype: int64

In [249]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
'b', 'b', 'b', 'b'],
'data': np.random.randn(8),
'weights': np.random.rand(8)})

In [251]:
df

  category      data   weights
0        a -1.076832  0.708778
1        a -2.104483  0.318800
2        a  1.483477  0.168663
3        a -0.845429  0.751856
4        b  1.335485  0.607722
5        b  0.013633  0.467123
6        b -0.573827  0.835016
7        b  0.056314  0.398947

In [252]:
grouped=df.groupby('category')
list(grouped)

[('a',
    category      data   weights
  0        a -1.076832  0.708778
  1        a -2.104483  0.318800
  2        a  1.483477  0.168663
  3        a -0.845429  0.751856),
 ('b',
    category      data   weights
  4        b  1.335485  0.607722
  5        b  0.013633  0.467123
  6        b -0.573827  0.835016
  7        b  0.056314  0.398947)]

In [253]:
get_wavg=lambda g: np.average(g['data'],weights=g['weights'])

In [258]:
grouped.apply(get_wavg)

category
a   -0.934029
b    0.156480
dtype: float64

In [265]:
a=pd.Series(np.arange(10))
np.average(a)

4.5

In [268]:
np.quantile(a,0.5)

4.5

In [277]:
close_px=pd.read_csv('stock.csv',parse_dates=True,index_col=0)
close_px

              AAPL   MSFT    XOM      SPX
2003-01-02    7.40  21.11  29.22   909.03
2003-01-03    7.45  21.14  29.24   908.59
2003-01-06    7.45  21.52  29.96   929.01
2003-01-07    7.43  21.93  28.95   922.93
2003-01-08    7.28  21.31  28.83   909.93
...            ...    ...    ...      ...
2011-10-10  388.81  26.94  76.28  1194.89
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

[2214 rows x 4 columns]

In [275]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [276]:
spx_corr=lambda x:x.corrwith(s['SPX'])
rets=